app/views/absences/index.html.erb

        <% if !current_user.users_absences.nil? %>
          <% current_user.users_absences.each do |absence| %>
            <tr>
            <% @absence = Absence.find(absence.absence_id) %>
---
SELECT "users_absences".* FROM "users_absences" WHERE "users_absences"."user_id" = ?  [["user_id", 2]]
SELECT  "absences".* FROM "absences" WHERE "absences"."id" = ? LIMIT 1  [["id", 1]]

              <td><%= @absence.date %></td>
              <td><%= User.find(@absence.manager_id).email %></td>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 1]]

      <tbody>
      <% absence_ids = Absence.all.where(:manager_id => current_user.id) %>
      <% absence_ids.each do |a| %>
        <% absence = UsersAbsence.find(a) %>
---
SELECT "absences".* FROM "absences" WHERE "absences"."manager_id" = ?  [["manager_id", 1]]
SELECT  "users_absences".* FROM "users_absences" WHERE "users_absences"."id" = ? LIMIT 1  [["id", 1]]