app/views/absences/show.html.erb

    <dt>Manager:</dt>
    <dd><%= User.find(@absence.manager_id).email %></dd><br>

    <% @users_absence = UsersAbsence.find(@absence.id) %>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 2]]
SELECT  "absences".* FROM "absences" WHERE "absences"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "users_absences".* FROM "users_absences" WHERE "users_absences"."id" = ? LIMIT 1  [["id", 1]]