app/controllers/absences_controller.rb

SELECT "users".* FROM "users" WHERE "users"."role" = ?  [["role", "manager"]]
---
  def new
    @absence = Absence.new
    @manager_users = User.where(:role=>"manager")

SELECT "users".* FROM "users" WHERE "users"."role" = ?  [["role", "manager"]]
INSERT INTO "absences" ("reason", "from_date", "manager_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["reason", "srrgr"], ["from_date", "09-12-2015 to 24-12-2015"], ["manager_id", 1], ["created_at", "2015-12-06 11:02:20.247622"], ["updated_at", "2015-12-06 11:02:20.247622"]]
INSERT INTO "users_absences" ("absence_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["absence_id", 1], ["user_id", 2], ["created_at", "2015-12-06 11:02:20.565522"], ["updated_at", "2015-12-06 11:02:20.565522"]]
---
  def create
    @manager_users = User.where(:role=>"manager")
    @absence = current_user.absences.build(absence_params)
    respond_to do |format|
      if @absence.save
        @absence.update_attributes(:user_id=>current_user.id)
        UsersAbsence.create(:absence_id =>@absence.id ,:user_id => @absence.user_id)

SELECT  "users_absences".* FROM "users_absences" WHERE "users_absences"."absence_id" = ?  ORDER BY "users_absences"."id" DESC LIMIT 1  [["absence_id", 1]]
UPDATE "users_absences" SET "is_approve" = ?, "status" = ?, "updated_at" = ? WHERE "users_absences"."id" = ?  [["is_approve", "t"], ["status", "approved"], ["updated_at", "2015-12-06 11:45:42.238346"], ["id", 1]]
---
  def absence_approve
    @user_absence = UsersAbsence.where(:absence_id =>params[:absence_id]).last
    @user_absence.update_attributes(:is_approve => true,:status=>"approved")

SELECT  "users_absences".* FROM "users_absences" WHERE "users_absences"."absence_id" = ?  ORDER BY "users_absences"."id" DESC LIMIT 1  [["absence_id", 1]]
UPDATE "absences" SET "reject_msg" = ?, "updated_at" = ? WHERE "absences"."id" = ?  [["reject_msg", "rrrrrrr"], ["updated_at", "2015-12-06 11:03:38.336268"], ["id", 1]]
UPDATE "users_absences" SET "status" = ?, "updated_at" = ? WHERE "users_absences"."id" = ?  [["status", "rejected"], ["updated_at", "2015-12-06 11:03:38.120654"], ["id", 1]]
SELECT  "absences".* FROM "absences" WHERE "absences"."id" = ? LIMIT 1  [["id", 1]]
---
  def absence_reject
    @user_absence = UsersAbsence.where(:absence_id =>params[:absence_id]).last
    @user_absence.update_attributes(:is_approve => false,:status=>"rejected")
    @user_absence.save
    @absence = Absence.find(@user_absence.absence_id)

SELECT  "absences".* FROM "absences" WHERE "absences"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_absence
      @absence = Absence.find(params[:id])